{"keras_version": "1.0.5", "sample_weight_mode": null, "loss": "mse", "config": [{"config": {"name": "dense_1", "batch_input_shape": [null, 2709], "activation": "linear", "input_dtype": "float32", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 3072, "input_dim": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 1e-06, "name": "batchnormalization_1", "momentum": 0.9, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leakyrelu_1", "alpha": 0.3}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "linear", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 3072, "input_dim": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 1e-06, "name": "batchnormalization_2", "momentum": 0.9, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leakyrelu_2", "alpha": 0.3}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "activation": "linear", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 3072, "input_dim": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 1e-06, "name": "batchnormalization_3", "momentum": 0.9, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leakyrelu_3", "alpha": 0.3}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "activation": "linear", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 129, "input_dim": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 1e-06, "name": "batchnormalization_4", "momentum": 0.9, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "optimizer": {"lr": 0.009999999776482582, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "name": "Adam", "beta_1": 0.8999999761581421}}